const brigadeData = {
    driver: "Голубович",
    assistant: "Фофанов",
    totalHours: "165.9+19.1",
    
    schedule: [
        { day: 1, yavka: "116" },
        { day: 2, yavka: "173"  },
        { day: 3, yavka: "113" },
        { day: 4, yavka: "117" },
        { day: 5, yavka: "135" },
        { day: 6, yavka: "", isWeekend: true},
        
        { day: 7, yavka: "46" },
        { day: 8, yavka: "6" },
        { day: 9, yavka: "161" },
        { day: 10, yavka: "", isWeekend: true },
        { day: 11, yavka: "115" },
        { day: 12, yavka: "122" },
        { day: 13, yavka: "133" },
        
        { day: 14, yavka: "104" },
        { day: 15, yavka: "", isWeekend: true },
        { day: 16, yavka: "", isWeekend: true },
        { day: 17, yavka: "174" },
        { day: 18, yavka: "128" },
        { day: 19, yavka: "102" },
        { day: 20, yavka: "114" },
        
        { day: 21, yavka: "135" },
        { day: 22, yavka: "", isWeekend: true },
        { day: 23, yavka: "152" },
        { day: 24, yavka: "174" },
        { day: 25, yavka: "129" },
        { day: 26, yavka: "112" },
        { day: 27, yavka: "114" },
        { day: 28, yavka: "133" },
        { day: 29, yavka: "104" }
    ]
};

const yavkaDatabase = {
    "116": {
        number: "116",
        time: "12.08",
        сдача: "22.15 ТЧ-9",
        рабочееВремя: "10.07",
        изПодПоезда: "6039",
        номерПоездов: "6042-6041, 6093-6094<br>6044-6043"
    },
    
    "173": {
        number: "173",
        time: "5.07 ТЧ-9",
        сдача: "12.12",
        рабочееВремя: "11.09",
        изПодПоезда: "755/6049",
        номерПоездов: "Выгон 716<br>Загон 755<br>6054-6053"
    },
    
    "113": {
        number: "113",
        time: "7.00",
        сдача: "15.06",
        рабочееВремя: "8.06",
        изПодПоезда: "6066",
        номерПоездов: "6073-6074, 6040-6039<br>выгон 866"
    },
    
    "117": {
        number: "117",
        time: "9.24 Депо",
        сдача: "20.43",
        рабочееВремя: "11.19",
        изПодПоезда: "6053",
        номерПоездов: "Выгон 864, 6083-6084<br>6058-6057,6062-6061"
    },
    
    "135": {
        number: "135",
        time: "20.34",
        сдача: "7.39",
        рабочееВремя: "11.05",
        изПодПоезда: "6140",
        номерПоездов: "6065-6066"
    },
    
    "161": {
        number: "161",
        time: "22.15 Депо",
        сдача: "9.33",
        рабочееВремя: "11.18",
        изПодПоезда: "",
        номерПоездов: "6046-7901, 6050-6049"
    },
    
    "115": {
        number: "115",
        time: "8.32 Депо",
        сдача: "19.38 Депо",
        рабочееВремя: "11.06",
        изПодПоезда: "739",
        номерПоездов: "727-728, загон 739"
    },
    
    "122": {
        number: "122",
        time: "12.32",
        сдача: "23.38 Депо",
        рабочееВремя: "11.06",
        изПодПоезда: "Из депо",
        номерПоездов: "874-873"
    },
    
    "133": {
        number: "133",
        time: "17.33",
        сдача: "0.25 Брест",
        рабочееВремя: "6.52",
        изПодПоезда: "728",
        номерПоездов: "701"
    },
    
    "104": {
        number: "104",
        time: "4.58 Брест",
        сдача: "10.55 Депо",
        рабочееВремя: "5.57",
        изПодПоезда: "701",
        номерПоездов: "702"
    },
    
    "174": {
        number: "174",
        time: "10.59 Депо",
        сдача: "22.08 Депо",
        рабочееВремя: "11.09",
        изПодПоезда: "",
        номерПоездов: "750-749"
    },
    
    "128": {
        number: "128",
        time: "14.47",
        сдача: "21.40 ТЧ-9",
        рабочееВремя: "6.53",
        изПодПоезда: "6055",
        номерПоездов: "6060-6059, 6099-6140"
    },
    
    "102": {
        number: "102",
        time: "3.07 ТЧ-9",
        сдача: "9.56 Депо",
        рабочееВремя: "6.49",
        изПодПоезда: "",
        номерПоездов: "6036-6035"
    },
    
    "114": {
        number: "114",
        time: "7.15",
        сдача: "17.45",
        рабочееВремя: "10.50",
        изПодПоезда: "6070/7324",
        номерПоездов: "6052-6051, 6079-6080<br>6056-6055, 7327-7326"
    },
    
    "152": {
        number: "152",
        time: "6.30",
        сдача: "14.23",
        рабочееВремя: "7.53",
        изПодПоезда: "Из депо",
        номерПоездов: "716-747"
    },
    
    "129": {
        number: "129",
        time: "16.31 Депо",
        сдача: "23.18 Брест",
        рабочееВремя: "6.47",
        изПодПоезда: "",
        номерПоездов: "735"
    },
    "112": {
        number: "112",
        time: "6.48 Брест",
        сдача: "13.10 Депо",
        рабочееВремя: "6.22",
        изПодПоезда: "735",
        номерПоездов: "736"
    },

    "46": {
        number: "46",
        time: "16.41",
        сдача: "22.50 д ТЧ-9",
        рабочееВремя: "6.09",
        изПодПоезда: "6919",
        номерПоездов: "6920-6927 отд. ТЧ-9"
    },

    "6": {
        number: "6",
        time: "3.08 д ТЧ-9",
        сдача: "10.43",
        рабочееВремя: "7.35",
        изПодПоезда: "",
        номерПоездов: "6805-6812"
    }
};
